[NoCoverage] ArrowFunction
app.ts:46:45
             <div class="card">
                 <h3>Palabras Clave Principales</h3>
                 <ol>
-                    ${stats.topKeywords.map(keyword => `<li>${keyword}</li>`).join("")}
+                    ${stats.topKeywords.map(() => undefined).join("")}
                 </ol>
             </div>

[NoCoverage] BlockStatement
app.ts:53:51
     }
 
     // Evento al hacer clic en el botón de analizar
-    analyzeButton.addEventListener("click", () => {
-        const text = textInput.value;
-        const stats = analyzeText(text);
-        displayResults(stats);
-    });
+    analyzeButton.addEventListener("click", () => {});
 
     // Actualización en tiempo real para el conteo de caracteres y palabras

[NoCoverage] BlockStatement
app.ts:60:47
     });
 
     // Actualización en tiempo real para el conteo de caracteres y palabras
-    textInput.addEventListener("input", () => {
-        const text = textInput.value;
-        const wordCount = text.trim() === "" ? 0 : text.trim().split(/\s+/).length;
-        const characterCount = text.length;
-        // Puedes mostrar estas estadísticas en tiempo real en la interfaz si quieres
-        console.log("Conteo de Caracteres:", characterCount, "Conteo de Palabras:", wordCount);
-    });
+    textInput.addEventListener("input", () => {});
 });

[NoCoverage] ConditionalExpression
app.ts:62:27
     // Actualización en tiempo real para el conteo de caracteres y palabras
     textInput.addEventListener("input", () => {
         const text = textInput.value;
-        const wordCount = text.trim() === "" ? 0 : text.trim().split(/\s+/).length;
+        const wordCount = true ? 0 : text.trim().split(/\s+/).length;
         const characterCount = text.length;
         // Puedes mostrar estas estadísticas en tiempo real en la interfaz si quieres

[NoCoverage] ConditionalExpression
app.ts:62:27
     // Actualización en tiempo real para el conteo de caracteres y palabras
     textInput.addEventListener("input", () => {
         const text = textInput.value;
-        const wordCount = text.trim() === "" ? 0 : text.trim().split(/\s+/).length;
+        const wordCount = false ? 0 : text.trim().split(/\s+/).length;
         const characterCount = text.length;
         // Puedes mostrar estas estadísticas en tiempo real en la interfaz si quieres
