[Killed] ConditionalExpression
analyzer.ts:61:17
   const characterCountNoSpaces = text.replace(/\s/g, "").length;
 
   // Nueva regex que maneja guiones y evita tokens vacíos
-  const words = text.toLowerCase()
-    .match(/[\p{L}\p{N}]+(?:-[\p{L}\p{N}]+)*/gu) || [];
+  const words = true;
   const wordCount = words.length;
 
killedBy: Pruebas de conteo de caracteres Texto vacío
statusReason: TypeError: words.reduce is not a function

[Killed] MethodExpression
analyzer.ts:61:17
   const characterCountNoSpaces = text.replace(/\s/g, "").length;
 
   // Nueva regex que maneja guiones y evita tokens vacíos
-  const words = text.toLowerCase()
+  const words = text.toUpperCase()
     .match(/[\p{L}\p{N}]+(?:-[\p{L}\p{N}]+)*/gu) || [];
   const wordCount = words.length;
killedBy: Pruebas de conteo de palabras Texto con mayúsculas y minúsculas
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: undefined

[Killed] Regex
analyzer.ts:62:12
 
   // Nueva regex que maneja guiones y evita tokens vacíos
   const words = text.toLowerCase()
-    .match(/[\p{L}\p{N}]+(?:-[\p{L}\p{N}]+)*/gu) || [];
+    .match(/[\p{L}\P{N}]+(?:-[\p{L}\p{N}]+)*/gu) || [];
   const wordCount = words.length;
 
killedBy: Pruebas de conteo de palabras Texto simple
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] Regex
analyzer.ts:62:12
 
   // Nueva regex que maneja guiones y evita tokens vacíos
   const words = text.toLowerCase()
-    .match(/[\p{L}\p{N}]+(?:-[\p{L}\p{N}]+)*/gu) || [];
+    .match(/[\P{L}\p{N}]+(?:-[\p{L}\p{N}]+)*/gu) || [];
   const wordCount = words.length;
 
killedBy: Pruebas de conteo de palabras Texto simple
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] EqualityOperator
analyzer.ts:65:54
     .match(/[\p{L}\p{N}]+(?:-[\p{L}\p{N}]+)*/gu) || [];
   const wordCount = words.length;
 
-  const sentences = text.split(/[.!?]+/).filter(s => s.trim().length > 0);
+  const sentences = text.split(/[.!?]+/).filter(s => s.trim().length <= 0);
   const sentenceCount = sentences.length;
 
killedBy: Pruebas de oraciones y párrafos Texto con signos de puntuación
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 1

[Killed] ArrowFunction
analyzer.ts:65:49
     .match(/[\p{L}\p{N}]+(?:-[\p{L}\p{N}]+)*/gu) || [];
   const wordCount = words.length;
 
-  const sentences = text.split(/[.!?]+/).filter(s => s.trim().length > 0);
+  const sentences = text.split(/[.!?]+/).filter(() => undefined);
   const sentenceCount = sentences.length;
 
killedBy: Pruebas de oraciones y párrafos Texto con signos de puntuación
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 0

[Killed] ConditionalExpression
analyzer.ts:68:55
   const sentences = text.split(/[.!?]+/).filter(s => s.trim().length > 0);
   const sentenceCount = sentences.length;
 
-  const paragraphs = text.split(/\n{2,}/).filter(p => p.trim().length > 0);
+  const paragraphs = text.split(/\n{2,}/).filter(p => false);
   const paragraphCount = paragraphs.length;
 
killedBy: Pruebas de oraciones y párrafos Texto con saltos de línea
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[Killed] EqualityOperator
analyzer.ts:68:55
   const sentences = text.split(/[.!?]+/).filter(s => s.trim().length > 0);
   const sentenceCount = sentences.length;
 
-  const paragraphs = text.split(/\n{2,}/).filter(p => p.trim().length > 0);
+  const paragraphs = text.split(/\n{2,}/).filter(p => p.trim().length <= 0);
   const paragraphCount = paragraphs.length;
 
killedBy: Pruebas de oraciones y párrafos Texto con saltos de línea
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[Killed] ArrowFunction
analyzer.ts:71:40
   const paragraphs = text.split(/\n{2,}/).filter(p => p.trim().length > 0);
   const paragraphCount = paragraphs.length;
 
-  const totalWordLength = words.reduce((sum, word) => sum + word.length, 0);
+  const totalWordLength = words.reduce(() => undefined, 0);
   const averageWordLength = wordCount > 0 ? totalWordLength / wordCount : 0;
   const averageSentenceLength = sentenceCount > 0 ? wordCount / sentenceCount : 0;
killedBy: Pruebas de promedios Promedio de longitud de palabras
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 4.5
Received: NaN

Expected precision:    2
Expected difference: < 0.005
Received difference:   NaN

[Killed] ArithmeticOperator
analyzer.ts:71:55
   const paragraphs = text.split(/\n{2,}/).filter(p => p.trim().length > 0);
   const paragraphCount = paragraphs.length;
 
-  const totalWordLength = words.reduce((sum, word) => sum + word.length, 0);
+  const totalWordLength = words.reduce((sum, word) => sum - word.length, 0);
   const averageWordLength = wordCount > 0 ? totalWordLength / wordCount : 0;
   const averageSentenceLength = sentenceCount > 0 ? wordCount / sentenceCount : 0;
killedBy: Pruebas de promedios Promedio de longitud de palabras
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 4.5
Received: -4.5

Expected precision:    2
Expected difference: < 0.005
Received difference:   9

[Killed] EqualityOperator
analyzer.ts:72:29
   const paragraphCount = paragraphs.length;
 
   const totalWordLength = words.reduce((sum, word) => sum + word.length, 0);
-  const averageWordLength = wordCount > 0 ? totalWordLength / wordCount : 0;
+  const averageWordLength = wordCount <= 0 ? totalWordLength / wordCount : 0;
   const averageSentenceLength = sentenceCount > 0 ? wordCount / sentenceCount : 0;
 
killedBy: Pruebas de promedios Promedio de longitud de palabras
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 4.5
Received: 0

Expected precision:    2
Expected difference: < 0.005
Received difference:   4.5

[Killed] ArithmeticOperator
analyzer.ts:72:45
   const paragraphCount = paragraphs.length;
 
   const totalWordLength = words.reduce((sum, word) => sum + word.length, 0);
-  const averageWordLength = wordCount > 0 ? totalWordLength / wordCount : 0;
+  const averageWordLength = wordCount > 0 ? totalWordLength * wordCount : 0;
   const averageSentenceLength = sentenceCount > 0 ? wordCount / sentenceCount : 0;
 
killedBy: Pruebas de promedios Promedio de longitud de palabras
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 4.5
Received: 18

Expected precision:    2
Expected difference: < 0.005
Received difference:   13.5

[Killed] ConditionalExpression
analyzer.ts:73:33
 
   const totalWordLength = words.reduce((sum, word) => sum + word.length, 0);
   const averageWordLength = wordCount > 0 ? totalWordLength / wordCount : 0;
-  const averageSentenceLength = sentenceCount > 0 ? wordCount / sentenceCount : 0;
+  const averageSentenceLength = false ? wordCount / sentenceCount : 0;
 
   // Mejorado el cálculo de frecuencia de palabras
killedBy: Pruebas de promedios Promedio de palabras por oración
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 3
Received: 0

Expected precision:    2
Expected difference: < 0.005
Received difference:   3

[Killed] ConditionalExpression
analyzer.ts:73:33
 
   const totalWordLength = words.reduce((sum, word) => sum + word.length, 0);
   const averageWordLength = wordCount > 0 ? totalWordLength / wordCount : 0;
-  const averageSentenceLength = sentenceCount > 0 ? wordCount / sentenceCount : 0;
+  const averageSentenceLength = true ? wordCount / sentenceCount : 0;
 
   // Mejorado el cálculo de frecuencia de palabras
killedBy: Pruebas de promedios Promedio con oraciones vacías
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 0
Received: NaN

Expected precision:    2
Expected difference: < 0.005
Received difference:   NaN

[Killed] BlockStatement
analyzer.ts:77:29
 
   // Mejorado el cálculo de frecuencia de palabras
   const wordFrequency = new Map<string, number>();
-  for (const word of words) {
-    wordFrequency.set(word, (wordFrequency.get(word) || 0) + 1);
-  }
+  for (const word of words) {}
 
   // Modificado para devolver solo top 2 keywords ordenados por frecuencia y alfabéticamente
killedBy: Pruebas de conteo de palabras Texto con mayúsculas y minúsculas
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: undefined

[Killed] ArithmeticOperator
analyzer.ts:78:29
   // Mejorado el cálculo de frecuencia de palabras
   const wordFrequency = new Map<string, number>();
   for (const word of words) {
-    wordFrequency.set(word, (wordFrequency.get(word) || 0) + 1);
+    wordFrequency.set(word, (wordFrequency.get(word) || 0) - 1);
   }
 
killedBy: Pruebas de conteo de palabras Texto con mayúsculas y minúsculas
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: -3

[Killed] LogicalOperator
analyzer.ts:78:30
   // Mejorado el cálculo de frecuencia de palabras
   const wordFrequency = new Map<string, number>();
   for (const word of words) {
-    wordFrequency.set(word, (wordFrequency.get(word) || 0) + 1);
+    wordFrequency.set(word, (wordFrequency.get(word) && 0) + 1);
   }
 
killedBy: Pruebas de conteo de palabras Texto con mayúsculas y minúsculas
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: NaN

[Killed] MethodExpression
analyzer.ts:82:23
   }
 
   // Modificado para devolver solo top 2 keywords ordenados por frecuencia y alfabéticamente
-  const topKeywords = Array.from(wordFrequency.entries())
-    .filter(([word]) => !stopWords.has(word))
+  const topKeywords = Array.from(wordFrequency.entries())
     .sort((a, b) => b[1] - a[1] || a[0].localeCompare(b[0]))
     .slice(0, 2)
killedBy: Pruebas de palabras clave y únicas Top keywords excluye stop words
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 1

  Array [
    "mundo",
+   "el",

[Killed] MethodExpression
analyzer.ts:82:23
   }
 
   // Modificado para devolver solo top 2 keywords ordenados por frecuencia y alfabéticamente
-  const topKeywords = Array.from(wordFrequency.entries())
-    .filter(([word]) => !stopWords.has(word))
-    .sort((a, b) => b[1] - a[1] || a[0].localeCompare(b[0]))
-    .slice(0, 2)
+  const topKeywords = Array.from(wordFrequency.entries()).filter(([word]) => !stopWords.has(word)).sort((a, b) => b[1] - a[1] || a[0].localeCompare(b[0]))
     .map(([word]) => word);
 
killedBy: Pruebas de palabras clave y únicas Top keywords con varias palabras
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 1

  Array [
    "banana",
    "manzana",

[Killed] BooleanLiteral
analyzer.ts:83:25
 
   // Modificado para devolver solo top 2 keywords ordenados por frecuencia y alfabéticamente
   const topKeywords = Array.from(wordFrequency.entries())
-    .filter(([word]) => !stopWords.has(word))
+    .filter(([word]) => stopWords.has(word))
     .sort((a, b) => b[1] - a[1] || a[0].localeCompare(b[0]))
     .slice(0, 2)
killedBy: Pruebas de palabras clave y únicas Top keywords excluye stop words
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "mundo",
+   "el",

[Killed] ArrowFunction
analyzer.ts:83:13
 
   // Modificado para devolver solo top 2 keywords ordenados por frecuencia y alfabéticamente
   const topKeywords = Array.from(wordFrequency.entries())
-    .filter(([word]) => !stopWords.has(word))
+    .filter(() => undefined)
     .sort((a, b) => b[1] - a[1] || a[0].localeCompare(b[0]))
     .slice(0, 2)
killedBy: Pruebas de palabras clave y únicas Top keywords excluye stop words
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   "mundo",
- ]

[Killed] ConditionalExpression
analyzer.ts:84:21
   // Modificado para devolver solo top 2 keywords ordenados por frecuencia y alfabéticamente
   const topKeywords = Array.from(wordFrequency.entries())
     .filter(([word]) => !stopWords.has(word))
-    .sort((a, b) => b[1] - a[1] || a[0].localeCompare(b[0]))
+    .sort((a, b) => true)
     .slice(0, 2)
     .map(([word]) => word);
killedBy: Pruebas de palabras clave y únicas Top keywords con varias palabras
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "banana",
    "manzana",

[Killed] ArithmeticOperator
analyzer.ts:84:21
   // Modificado para devolver solo top 2 keywords ordenados por frecuencia y alfabéticamente
   const topKeywords = Array.from(wordFrequency.entries())
     .filter(([word]) => !stopWords.has(word))
-    .sort((a, b) => b[1] - a[1] || a[0].localeCompare(b[0]))
+    .sort((a, b) => b[1] + a[1] || a[0].localeCompare(b[0]))
     .slice(0, 2)
     .map(([word]) => word);
killedBy: Pruebas de palabras clave y únicas Top keywords con varias palabras
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "banana",
    "manzana",

[Killed] ArrowFunction
analyzer.ts:86:10
     .filter(([word]) => !stopWords.has(word))
     .sort((a, b) => b[1] - a[1] || a[0].localeCompare(b[0]))
     .slice(0, 2)
-    .map(([word]) => word);
+    .map(() => undefined);
 
   const uniqueWordCount = wordFrequency.size;
killedBy: Pruebas de palabras clave y únicas Top keywords excluye stop words
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "mundo",
+   undefined,
